app/Controllers/Carrito_controller.php

	public function ListComprasCabecera(){
		//Me conecto a la base de datos
		$db = db_connect();
		//Me ubico en la tabla ventas_cabecera y genero un alias "u" y guardo su contenido en $bluider
		$builder = $db->table('ventas_cabecera u');
		//Selecciono de ambas tablas (Cabecera y Detalle) los campos que necesito mostrar en la vista
		$builder->select('u.id , d.nombre , d.apellido, d.telefono , d.direccion , u.total_venta , u.fecha , u.hora , u.tipo_pago');
		//Con un Join relaciono los "id" de ambas tablas para generar una sola con todos los datos
		$builder->join('usuarios d','u.usuario_id = d.id');
		//Guardo el contenido de la relacion de ambas tablas en la variable $ventas
		$ventas= $builder->get();
---
SELECT `u`.`id`, `d`.`nombre`, `d`.`apellido`, `d`.`telefono`, `d`.`direccion`, `u`.`total_venta`, `u`.`fecha`, `u`.`hora`, `u`.`tipo_pago`
FROM `ventas_cabecera` `u`
JOIN `usuarios` `d` ON `u`.`usuario_id` = `d`.`id`

	public function ListComprasCabeceraCliente($id){
		$fechaHoy = date('d-m-Y');
		//Me conecto a la base de datos
		$db = db_connect();
		//Me ubico en la tabla ventas_cabecera y genero un alias "u" y guardo su contenido en $bluider
		$builder = $db->table('ventas_cabecera u');
		//Filtro las ventas para que solo rescate las ventas de este Cliente mediante su id.
		$builder->where('usuario_id',$id);
		//Trae las ventas del dia.
		$builder->where('fecha',$fechaHoy);
		//Selecciono de ambas tablas (Cabecera y Detalle) los campos que necesito mostrar en la vista
		$builder->select('u.id , d.nombre , d.apellido, d.telefono , d.direccion , u.total_venta , u.fecha , u.hora , u.tipo_pago');
		//Con un Join relaciono los "id" de ambas tablas para generar una sola con todos los datos
		$builder->join('usuarios d','u.usuario_id = d.id');
		//Guardo el contenido de la relacion de ambas tablas en la variable $ventas
		$ventas= $builder->get();
---
SELECT `u`.`id`, `d`.`nombre`, `d`.`apellido`, `d`.`telefono`, `d`.`direccion`, `u`.`total_venta`, `u`.`fecha`, `u`.`hora`, `u`.`tipo_pago`
FROM `ventas_cabecera` `u`
JOIN `usuarios` `d` ON `u`.`usuario_id` = `d`.`id`
WHERE `usuario_id` = '2'
AND `fecha` = '16-11-2024'

				'stock'  => $stock_edit,
				];

            	$producto = $Producto_model->update($item['id'],$datos);
---
UPDATE `productos` SET `stock` = 5
WHERE `productos`.`id` IN ('2')